{"src/common/commandExecutor":["Packager beendet.","Packager nicht gefunden."],"src/common/packager":["Die Packager-Optionen konnten nicht aus \"exp.json\" gelesen werden. Der Vorgang wird fortgesetzt...","Packager wird gestartet.","Packager gestartet.","Packager wird bereits ausgeführt.","React Native-Packager wird außerhalb von VS Code ausgeführt. Wenn Sie ein Debugging durchführen möchten, verwenden Sie die Option zum Anfügen an den Packager.","Packager wird noch ausgeführt. Wenn der Packager außerhalb von VS Code gestartet wurde, beenden Sie den Packager-Prozess über den Task-Manager.","Packager wird nicht ausgeführt.","Packager wird noch ausgeführt. Wenn der Packager außerhalb von VS Code gestartet wurde, beenden Sie den Packager-Prozess über den Task-Manager.","Packager wird nicht ausgeführt.","Der Einstiegspunkt ist weder in \"index.js\" noch in \"index.{0}.js\" enthalten. Die vorbereitende Aufwärmphase wird übersprungen...","Folgendes wird abgerufen: {0}","Vorbereitende Aufwärmphase für Bundlecache abgeschlossen.","Der Packager konnte nicht gestartet werden.","Packager wird beendet"],"src/common/error/errorStrings":["Fehler beim Ausführen des Befehls \"{0}\".","Fehler bei Befehl \"{0}\". Fehlercode: {1}.","Es wurde eine ganze Zahl erwartet. \"{0}\" konnte nicht gelesen werden.","Fehler beim Ausführen des React Native-Packagers.","\"ios-deploy\" wurde nicht gefunden. Stellen Sie sicher, dass das Paket global installiert wurde (\"npm install -g ios-deploy\").","Das Datenträgerimage für Entwickler kann nicht bereitgestellt werden.","Das Datenträgerimage für Entwickler kann nicht bereitgestellt werden.","Die Anwendung kann nicht gestartet werden.","Timeout beim Starten der Anwendung. Ist das Gerät gesperrt?","Der iOS-Simulator kann nicht gestartet werden. Geben Sie ein anderes Ziel an.","Speicherort für opn-Paket nicht gefunden.","\"opn\" für Paket nicht gefunden. {0}","Fehler bei der Suche nach Paket \"{0}\": {1}","Die Plattform \"{0}\" wird auf der Hostplattform \"{1}\" nicht unterstützt.","Die Versionskomponente des Pakets unter \"{0}\" konnte nicht analysiert werden: Version = {1}","Projektversion = {0}","Version kann nicht gelesen werden = {0}","{0}. Telemetrie konnte nicht initialisiert werden.","Fehler beim Aktivieren der React Native Tools-Erweiterung.","Fehler beim Einrichten des Stubstartprogramms für den Debugger.","Fehler beim Einrichten von IntelliSense.","Fehler beim Konfigurieren des Node-Debuggerspeicherorts für den Debugger.","Fehler beim Beenden des Packagers beim Schließen der React Native Tools.","Fehler beim Ausführen der Anwendung in Android.","Fehler beim Ausführen der Anwendung in iOS.","Fehler beim Ausführen der Anwendung in Expo.","Fehler beim Ausführen der Anwendung in Expo.","Fehler beim Starten des React Native-Packagers.","Fehler beim Beenden des React Native-Packagers.","Fehler beim Neustart des React Native-Packagers.","Debuggen der Anwendung nicht möglich.","Debuggen der Anwendung nicht möglich: Fehler im internen Node-Debugger.","Der temporäre Ordner \"{0}\" konnte nicht gelöscht werden.","Der Speicherort der node-debugger-Erweiterung wurde nicht gefunden.","Auf Port {0} kann kein Packager gestartet werden, weil bereits ein Packager-Prozess auf Port {1} ausgeführt wird.","Fehler beim Verarbeiten der Nachricht: \"{0}\"","Die Kommunikation mit der VSCode-Erweiterung \"react-native\" konnte nicht eingerichtet werden. Handelt es sich um ein react-native-Projekt, und haben Sie sichergestellt, dass das npm-Paket für \"react-native\" am Stamm installiert ist?","Unknown error: not all success patterns were matched. \n It means that \"react-native run-{0}\" command failed. \n Please, check the View -> Toggle Output -> React Native, \n View -> Toggle Output -> React Native: Run {1} output windows.","Die Versionskomponente des Pakets unter \"{0}\" konnte nicht analysiert werden: Version = {1}","Nicht unterstützter Befehlsstatus.","Expo hat keinen Link angegeben. Ist Ihr Projekt ordnungsgemäß eingerichtet?","Fehler beim Verwenden des Arbeitsbereichs: {0}","Die React Native-Version wird von Expo nicht unterstützt. Unterstützte Hauptversionen: {0}","Der Benutzer hat die Anmeldung abgebrochen.","Anfügen an Packager nicht möglich. Ist ein Packager vorhanden und wird auf Port {0} ausgeführt? Wenn Ihr Packager zur Ausführung auf einem anderen Port konfiguriert ist, müssen Sie diesen zur Datei \"settings.json\" hinzufügen.","Es ist bereits ein anderer Debugger mit dem Packager verbunden. Schließen Sie ihn, bevor Sie erneut versuchen, ein Debugging mit VSCode durchzuführen.","Seems to be that you are trying to debug from within directory that is not a React Native project root. \n If so, please, follow these instructions: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","Das sourcesStoragePath-Argument war NULL oder leer.","Could not install the app on any available device. Make sure you have a correctly \n configured device or emulator running. See https://facebook.github.io/react-native/docs/android-setup.html.","Timeout bei Android-Shellbefehl. Wiederholen Sie den Vorgang.","Android-Projekt nicht gefunden.","Mehr als ein Gerät/Emulator.","Fehler beim Starten der angegebenen Aktivität. Versuchen Sie, die Anwendung manuell auszuführen, und starten Sie das Debuggen mit der Startkonfiguration zum Anfügen an den Packager.","In \"{0}\" wurde mehr als eine ausführbare Datei gefunden. Bereinigen Sie den Buildordner, oder richten Sie die Startoption \"productName\" ein.","Ausführbare Datei nicht in \"{0}\" gefunden.","\"rnpm-plugin-windows\" ist nicht installiert.","React DevTools ist nicht installiert. Führen Sie den Befehl \"npm install -g react-devtools\" in Ihrem Terminal aus, um die Tools zu installieren.","{0}. Debuggen nicht möglich: Laden Sie JS aus der App neu, oder stellen Sie eine neue Verbindung mit dem VS Code-Debugger her.","Fehler beim erneuten Herstellen einer Verbindung mit dem Proxy (Packager). Überprüfen Sie das Ausgabefenster auf Packager-Fehler, sofern vorhanden. Falls der Fehler weiterhin besteht, starten Sie den React Native-Debugger neu.","Failed to process message from the React Native app. Message:\n{0}","Failed to prepare the JavaScript runtime environment. Message:\n{0}","Failed to send message to the React Native app. Message:\n{0}","Der React Native-Workerprozess hat einen Fehler ausgelöst.","Das Skript unter \"<{0}>\" konnte nicht importiert werden.","RNMessage mit Methode \"executeApplicationScript\" weist keine Eigenschaft \"url\" auf."],"src/debugger/appWorker":["Die Verbindung zwischen Proxy (Packager) und React Native-Anwendung wurde getrennt. Es wird in Kürze versucht, die Verbindung erneut herzustellen...","Es wurde eine Verbindung zwischen dem Proxy (Packager) und der React Native-Anwendung eingerichtet."],"src/debugger/nodeDebugWrapper":["Die logcat-Überwachung konnte nicht beendet werden: {0}","Launched debug configuration contains 'program' property which is deprecated and will be removed soon. Please replace it with: \"cwd\": \"${workspaceFolder}\"","Der Debugger-App-Worker wird gestartet.","Der Debuggerworker hat die Runtime auf Port {0} geladen.","Debuggen nicht möglich. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Der Debuggeradapter kann nicht gestartet werden: {0}"],"src/extension/commandPaletteHandler":["Die Veröffentlichung war nicht erfolgreich. Stellen Sie sicher, dass Sie in Expo angemeldet sind und Ihr Projekt ein gültiges Expo-Projekt ist.","Es wurde bereits eine andere Elementprüfung ausgeführt.","Die App wird auf dem Expo-Server veröffentlicht. Dieser Vorgang kann etwas Zeit in Anspruch nehmen.","Die Expo-App wurde erfolgreich in \"{0}\" veröffentlicht.","Es wurde ein Fehler erkannt. Stellen Sie sicher, dass Sie in Expo angemeldet sind, dass Ihr Projekt ordnungsgemäß für die Veröffentlichung eingerichtet ist und Ihr Packager als Expo ausgeführt wird."],"src/extension/debugConfigurationProvider":["Run and debug Android application","Run and debug iOS application","Attach to already working application packager","Debug Expo application or React Native application in Expo","Pick debug configurations"],"src/extension/extensionServer":["Vorbereitende Aufwärmphase für Bundlecache wird ausgeführt. Dieser Vorgang kann etwas Zeit in Anspruch nehmen...","Die Anwendung wird erstellt und ausgeführt.","JS-Debugging aktivieren"],"src/extension/generalMobilePlatform":["React Native: \"{0}\" ausführen","Die Verbindung mit dem Packager wurde hergestellt. Sie können Ihre App jetzt im Simulator öffnen.","Der Debugger ist bereit. Aktivieren Sie das Remotedebugging in der App.","Der Debugger ist bereit. Deaktivieren Sie das Remotedebugging in der App.","Der React Native-Packager wird gestartet.","Anfügen an ausgeführten Native React-Packager wird ausgeführt."],"src/extension/openFileAtLocation":["Falsche Anzahl von Parametern angegeben. Zeigen Sie die Informationen zur ordnungsgemäßen Verwendung dieses Skripts an."],"src/extension/packagerStatusIndicator":["Packager starten","Packager neu starten","Packager starten","Packager beenden","React Native-Packager","{0}: beendet","{0}: wird beendet","{0}: gestartet","{0}: wird gestartet"],"src/extension/qrCodeContentProvider":["Expo wird ausgeführt. Öffnen Sie Ihre Expo-App unter <br/><span style=\"text-decoration: underline\">{0}</span><br/>, oder scannen Sie den nachstehenden QR-Code:"],"src/extension/rn-extension":["Für die React Native Tools muss React Native-Version 0.19.0 oder höher in \"<PROJEKTSTAMM>/node_modules/\" installiert sein.","React Native: Entwicklermenü für App anzeigen","React Native: App neu laden","React Native: Elementprüfung ausführen"],"src/extension/android/adb":["In der Datei \"local.properties\" wurde kein sdk.dir-Wert gefunden. Es wird der Android SDK-Speicherort aus PATH verwendet.","Es wird der in der android/local.properties-Datei definierte Android SDK-Speicherort verwendet: {0}.","Die Datei \"local.properties\" ist nicht vorhanden. Es wird der Android SDK-Speicherort aus PATH verwendet.","Lesen aus \"{0}\" nicht möglich.","Es wird der Android SDK-Speicherort aus PATH verwendet."],"src/extension/android/androidPlatform":["Target {0} is not supported for Android platform. \n If you want to use particular device or simulator for launching Android app,\n please specify  device id (as in 'adb devices' output) instead.","Device {0} supports only API Level {1}. \n Level {2} is needed to support port forwarding via adb reverse. \n For debugging to work you'll need <Shake or press menu button> for the dev menu, \n go into <Dev Settings> and configure <Debug Server host & port for Device> to be \n an IP address of your computer that the Device can reach. More info at: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Fehler bei der LogCat-Überwachung."],"src/extension/android/logCatMonitor":["Die LogCat-Überwachung wurde beendet, weil der Prozess beendet wurde.","Die LogCat-Überwachung wurde beendet, weil die Debugsitzung beendet wurde."],"src/extension/exponent/exponentHelper":["Es wird sichergestellt, dass Ihr Projekt die richtigen Abhängigkeiten für Expo verwendet. Dieser Vorgang kann etwas Zeit in Anspruch nehmen...","Es wird überprüft, ob es sich um eine Expo-App handelt.","[Warnung]: Das expo-Paket ist nicht lokal für Ihr Projekt installiert, es können weitere Fehler auftreten. Führen Sie \"npm install expo --save-dev\" in Ihrem Projekt aus.","Sie müssen sich bei Expo anmelden. Geben Sie nach dem Schließen dieses Fensters Ihren Expo-Kontobenutzernamen und das zugehörige Kennwort in die Eingabefelder ein. Falls Sie noch kein Konto besitzen, navigieren Sie zu https://expo.io, um ein Konto zu erstellen.","Expo-Benutzername","Expo-Kennwort"],"src/extension/exponent/exponentPlatform":["Die Anwendung wird auf Expo ausgeführt. Öffnen Sie Ihre Expo-App unter \"{0}\", um sie anzuzeigen.","Die Anwendung wird auf Expo ausgeführt. Schütteln Sie ihr Gerät, und wählen Sie die Option zum JS-Remotedebuggen aus, um das Debugging zu aktivieren."],"src/extension/ios/iOSDebugModeManager":["Die plist-Datei zum Konfigurieren des Debuggings wurde nicht gefunden."],"src/extension/ios/iOSPlatform":["Die Option \"iosRelativeProjectPath\" ist veraltet. Führen Sie stattdessen \"runArguments\" aus.","'--scheme' is set as 'runArguments' configuration parameter value, 'scheme' configuration parameter value will be omitted"],"src/extension/ios/simulatorPlist":["Es wurden mehrere plist-Kandidaten gefunden. Die Anwendung befindet sich möglicherweise nicht im Debugmodus."],"src/extension/windows/wpfPlatform":["Das Debuggen der WPF-Plattform wird für diese react-native-windows-Version ({0}) nicht unterstützt."]}